## Plan Result (860: prod_rbac - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 0 to change, 12 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Admin Login (env:production)-crime-portal-frontend-vm01-prod&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Admin Login (env:production)-crime-portal-frontend-vm02-prod&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Login (env:production)-crime-portal-frontend-vm01-prod&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Login (env:production)-crime-portal-frontend-vm02-prod&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Platform Operations SC-crime-portal-frontend-vm01-prod&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Platform Operations SC-crime-portal-frontend-vm02-prod&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Admin Login (env:production)-crime-portal-ldap-vm01-prod&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Admin Login (env:production)-crime-portal-ldap-vm02-prod&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Login (env:production)-crime-portal-ldap-vm01-prod&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Login (env:production)-crime-portal-ldap-vm02-prod&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Platform Operations SC-crime-portal-ldap-vm01-prod&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Platform Operations SC-crime-portal-ldap-vm02-prod&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Admin Login (env:production)-crime-portal-frontend-vm01-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod/providers/Microsoft.Authorization/roleAssignments/800f2948-c3d4-ce99-bb97-3a6f1cf7d4f8" -> (known after apply)
      ~ name                             = "800f2948-c3d4-ce99-bb97-3a6f1cf7d4f8" -> (known after apply)
      ~ principal_id                     = "ce1c26c9-b076-4ac4-b2c9-e63d8574e13c" -> "/groups/ce1c26c9-b076-4ac4-b2c9-e63d8574e13c" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Admin Login (env:production)-crime-portal-frontend-vm02-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod/providers/Microsoft.Authorization/roleAssignments/0f09bf8c-b2ed-8938-5430-4d01af1b263b" -> (known after apply)
      ~ name                             = "0f09bf8c-b2ed-8938-5430-4d01af1b263b" -> (known after apply)
      ~ principal_id                     = "ce1c26c9-b076-4ac4-b2c9-e63d8574e13c" -> "/groups/ce1c26c9-b076-4ac4-b2c9-e63d8574e13c" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Login (env:production)-crime-portal-frontend-vm01-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod/providers/Microsoft.Authorization/roleAssignments/67d3904c-a0b6-9895-a2a5-0a9e2de81e18" -> (known after apply)
      ~ name                             = "67d3904c-a0b6-9895-a2a5-0a9e2de81e18" -> (known after apply)
      ~ principal_id                     = "4c8e42c3-001c-4e50-9911-00cbe661ac62" -> "/groups/4c8e42c3-001c-4e50-9911-00cbe661ac62" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Login (env:production)-crime-portal-frontend-vm02-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod/providers/Microsoft.Authorization/roleAssignments/485f96be-7b6d-fa1e-99ef-49e5957306e6" -> (known after apply)
      ~ name                             = "485f96be-7b6d-fa1e-99ef-49e5957306e6" -> (known after apply)
      ~ principal_id                     = "4c8e42c3-001c-4e50-9911-00cbe661ac62" -> "/groups/4c8e42c3-001c-4e50-9911-00cbe661ac62" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Platform Operations SC-crime-portal-frontend-vm01-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-prod/providers/Microsoft.Authorization/roleAssignments/2bef94d1-57ed-a3e7-d6d6-38c6a1eb996e" -> (known after apply)
      ~ name                             = "2bef94d1-57ed-a3e7-d6d6-38c6a1eb996e" -> (known after apply)
      ~ principal_id                     = "4d0554dd-fe60-424a-be9c-36636826d927" -> "/groups/4d0554dd-fe60-424a-be9c-36636826d927" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Platform Operations SC-crime-portal-frontend-vm02-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "frontend_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-prod/providers/Microsoft.Authorization/roleAssignments/f769deaf-b1f0-7a80-b10f-a91929de352b" -> (known after apply)
      ~ name                             = "f769deaf-b1f0-7a80-b10f-a91929de352b" -> (known after apply)
      ~ principal_id                     = "4d0554dd-fe60-424a-be9c-36636826d927" -> "/groups/4d0554dd-fe60-424a-be9c-36636826d927" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Admin Login (env:production)-crime-portal-ldap-vm01-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod/providers/Microsoft.Authorization/roleAssignments/c9895e76-e16c-e180-44d7-40ec3ff41a59" -> (known after apply)
      ~ name                             = "c9895e76-e16c-e180-44d7-40ec3ff41a59" -> (known after apply)
      ~ principal_id                     = "ce1c26c9-b076-4ac4-b2c9-e63d8574e13c" -> "/groups/ce1c26c9-b076-4ac4-b2c9-e63d8574e13c" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Admin Login (env:production)-crime-portal-ldap-vm02-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod/providers/Microsoft.Authorization/roleAssignments/653683fd-ca86-907d-0b10-dd4a6f2b7e55" -> (known after apply)
      ~ name                             = "653683fd-ca86-907d-0b10-dd4a6f2b7e55" -> (known after apply)
      ~ principal_id                     = "ce1c26c9-b076-4ac4-b2c9-e63d8574e13c" -> "/groups/ce1c26c9-b076-4ac4-b2c9-e63d8574e13c" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Login (env:production)-crime-portal-ldap-vm01-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod/providers/Microsoft.Authorization/roleAssignments/60e15ad0-2396-1c15-b3aa-b61878c65acc" -> (known after apply)
      ~ name                             = "60e15ad0-2396-1c15-b3aa-b61878c65acc" -> (known after apply)
      ~ principal_id                     = "4c8e42c3-001c-4e50-9911-00cbe661ac62" -> "/groups/4c8e42c3-001c-4e50-9911-00cbe661ac62" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Login (env:production)-crime-portal-ldap-vm02-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod/providers/Microsoft.Authorization/roleAssignments/f0fe2e73-ab63-35c4-0b5d-d2712d775602" -> (known after apply)
      ~ name                             = "f0fe2e73-ab63-35c4-0b5d-d2712d775602" -> (known after apply)
      ~ principal_id                     = "4c8e42c3-001c-4e50-9911-00cbe661ac62" -> "/groups/4c8e42c3-001c-4e50-9911-00cbe661ac62" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Platform Operations SC-crime-portal-ldap-vm01-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-prod/providers/Microsoft.Authorization/roleAssignments/6a2dd274-36a1-ab6d-7261-e6412c6e1304" -> (known after apply)
      ~ name                             = "6a2dd274-36a1-ab6d-7261-e6412c6e1304" -> (known after apply)
      ~ principal_id                     = "4d0554dd-fe60-424a-be9c-36636826d927" -> "/groups/4d0554dd-fe60-424a-be9c-36636826d927" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Platform Operations SC-crime-portal-ldap-vm02-prod"] must be replaced
-/+ resource "azurerm_role_assignment" "ldap_rbac" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-prod/providers/Microsoft.Authorization/roleAssignments/f3c47174-a63b-1608-4b45-133a99f55fdb" -> (known after apply)
      ~ name                             = "f3c47174-a63b-1608-4b45-133a99f55fdb" -> (known after apply)
      ~ principal_id                     = "4d0554dd-fe60-424a-be9c-36636826d927" -> "/groups/4d0554dd-fe60-424a-be9c-36636826d927" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 12 to add, 0 to change, 12 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":71,"Program":"tfcmt","SHA1":"","Target":"860: prod_rbac - TerraformPlanApply","Vars":{}} -->